/*  ****************************************************************************
 *  tutorial.C89  include:C.dataType        ©[mATe64]           [2026-10-14]
 *  ****************************************************************************
    !$@€ƒ„…†‡‰¡“”•—Ÿ¢£¤¥¦§¨™©®×±«»♔♖♞♟°²³ƒµ¶·¹º¼½¾¿ÄÖÜäöüßæœžîðñôö÷αβγδεΦXΨ.Ω.*

 *  content:
    •   m:  F.macro
 * ************************************************************************.$.*/

#ifndef __USE_TUTOR_CPP_H__MACRO
#define __USE_TUTOR_CPP_H__MACRO

//  ============================================================================
//  m: F.macro (C-Style)
//  ============================================================================

#ifndef F_TUTOR__MAX
    #define F_TUTOR__MAX(a,b)   (((a) > (b)) ? (a) : (b))
#endif

#ifndef F_TUTOR__MIN
    #define F_TUTOR__MIN(a,b)   (((a) < (b)) ? (a) : (b))
#endif

#ifndef F_TUTOR__CAT
    #define F_TUTOR__CAT(A, B) { A##B }
#endif

//  swap(Byte)
#define F_TUTOR__SWAP8(x)   (   (((x) & 0xF0) >> 4) | (((x) & 0x0F) << 4) )

//  swap(Word)
#define F_TUTOR__SWAP16(x)  (   (((x) & 0xFF00) >> 8)   \
                            |   (((x) & 0x00FF) << 8)   )

//  swap(DWord)
#define F_TUTOR__SWAP32(x)  (   (((x) & 0xFF000000) >> 24)      \
                            |   (((x) & 0x00FF0000) >> 8)       \
                            |   (((x) & 0x0000FF00) << 8)       \
                            |   (((x) & 0x000000FF) << 24)      )

//  swap(QuadWord)
#define F_TUTOR__SWAP64(x) (    (((x) & 0xFF00000000000000) >> 56)      \
                            |   (((x) & 0x00FF000000000000) >> 40)      \
                            |   (((x) & 0x0000FF0000000000) >> 24)      \
                            |   (((x) & 0x000000FF00000000) >> 8)       \
                            |   (((x) & 0x00000000FF000000) << 8)       \
                            |   (((x) & 0x0000000000FF0000) << 24)      \
                            |   (((x) & 0x000000000000FF00) << 40)      )


#endif /* USE_TUTOR_CPP_H__macro */