/*  ****************************************************************************
 *  tutorial.C89  include:C.globals             ©[mATe64]           [2026-10-14]
 *  ****************************************************************************
 *  encoding: UTF-8
    !$@€ƒ„…†‡‰¡“”•—Ÿ¢£¤¥¦§¨™©®×±«»♔♖♞♟°²³ƒµ¶·¹º¼½¾¿ÄÖÜäöüßæœžîðñôö÷αβγδεΦXΨ.Ω.*
 *  ***********************************************************************.$.*/

#ifndef __USE_TUTOR_CPP_H__globals
#define __USE_TUTOR_CPP_H__globals

/*  ===========================================================================
 *  m:  C.globals
 *  ======================================================================== */

const   double  gC_E    = 2.71828182;    /* 2.718281928459045 */
const   double  gC_PI   = 3.14159265;    /* 3.141592653589793 */
const   int     gC_days_per_month[2][13] =
                {
                    {0,31,28,31,30,31,30,31,31,30,31,30,31},
                    {0,31,29,31,30,31,30,31,31,30,31,30,31}
                };

const   char  * gC_MonthName[] =
                {
                    "?MO",
                    "JAN","FEB","MAR","APR","MAY","JUN",
                    "JUL","AUG","SEP","OCT","NOV","DEC"
                };

const   char  * gC_WeekdayName[] =
                {
                    "?DY",
                    "MON","TUE","WED","THU","FRI","SAT","SUN"
                };

/* globale Variable */

char    gTimeStr[256];


#endif /* USE_TUTOR_CPP_H__globals */